
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>所有権 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="vector.html" />
    
    
    <link rel="prev" href="loop.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="install.html">
            
                <a href="install.html">
            
                    
                    インストール
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="hello.html">
            
                <a href="hello.html">
            
                    
                    Hello, world
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="variable.html">
            
                <a href="variable.html">
            
                    
                    変数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="function.html">
            
                <a href="function.html">
            
                    
                    関数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="primitive.html">
            
                <a href="primitive.html">
            
                    
                    プリミティブ型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="comment.html">
            
                <a href="comment.html">
            
                    
                    コメント
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="if.html">
            
                <a href="if.html">
            
                    
                    if
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="loop.html">
            
                <a href="loop.html">
            
                    
                    ループ
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="ownership.html">
            
                <a href="ownership.html">
            
                    
                    所有権
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="vector.html">
            
                <a href="vector.html">
            
                    
                    ベクター
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >所有権</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6240;&#x6709;&#x6A29;">&#x6240;&#x6709;&#x6A29;</h1>
<h2 id="&#x6982;&#x8981;">&#x6982;&#x8981;</h2>
<p>Rust&#x306E;&#x7279;&#x5FB4;&#x3067;&#x3042;&#x308A;&#x3001;Rust&#x306E;&#x6700;&#x5927;&#x306E;&#x76EE;&#x6A19;&#x3001;&#x30E1;&#x30E2;&#x30EA;&#x5B89;&#x5168;&#x6027;&#x3092;&#x5F97;&#x308B;&#x305F;&#x3081;&#x306E;&#x65B9;&#x6CD5;&#x3067;&#x3059;&#x3002;</p>
<p>Rust&#x306F;&#x300C;&#x30BC;&#x30ED;&#x30B3;&#x30B9;&#x30C8;&#x62BD;&#x8C61;&#x5316;&#x300D;&#x3092;&#x901A;&#x3058;&#x3066;&#x5B89;&#x5168;&#x6027;&#x3068;&#x30B9;&#x30D4;&#x30FC;&#x30C9;&#x3068;&#x3044;&#x3046;&#x76EE;&#x6A19;&#x3092;&#x9054;&#x6210;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x300C;&#x30BC;&#x30ED;&#x30B3;&#x30B9;&#x30C8;&#x62BD;&#x8C61;&#x5316;&#x300D;&#x3068;&#x306F;&#x62BD;&#x8C61;&#x5316;&#x3092;&#x6A5F;&#x80FD;&#x3055;&#x305B;&#x308B;&#x305F;&#x3081;&#x306E;&#x30B3;&#x30B9;&#x30C8;&#x3092;&#x3067;&#x304D;&#x308B;&#x9650;&#x308A;&#x5C0F;&#x3055;&#x304F;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x610F;&#x5473;&#x3057;&#x307E;&#x3059;&#x3002; &#x6240;&#x6709;&#x6A29;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306F;&#x30BC;&#x30ED;&#x30B3;&#x30B9;&#x30C8;&#x62BD;&#x8C61;&#x5316;&#x306E;&#x4E3B;&#x306A;&#x4F8B;&#x3067;&#x3001;&#x89E3;&#x6790;&#x306E;&#x5168;&#x3066;&#x306F; &#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x6642;&#x306B;&#x884C;&#x308F;&#x308C;&#x308B;&#x305F;&#x3081;&#x3069;&#x306E;&#x6A5F;&#x80FD;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x3082;&#x5B9F;&#x884C;&#x6642;&#x306E;&#x30B3;&#x30B9;&#x30C8;&#x306F;&#x5168;&#x304F;&#x639B;&#x304B;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;
&#x305F;&#x3060;&#x3057;&#x5B66;&#x7FD2;&#x30B3;&#x30B9;&#x30C8;&#x306F;&#x9AD8;&#x304F;&#x6163;&#x308C;&#x308B;&#x307E;&#x3067;&#x306A;&#x304B;&#x306A;&#x304B;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x304C;&#x901A;&#x3089;&#x306A;&#x3044;&#x305D;&#x3046;&#x3067;&#x3059;&#x3002;</p>
<h2 id="&#x6240;&#x6709;&#x6A29;">&#x6240;&#x6709;&#x6A29;</h2>
<p>Rust&#x3067;&#x306F;&#x5909;&#x6570;&#x306F;&#x6240;&#x6709;&#x6A29;&#x3092;&#x6301;&#x3061;&#x5909;&#x6570;&#x304C;&#x30B9;&#x30B3;&#x30FC;&#x30D7;&#x304B;&#x3089;&#x5916;&#x308C;&#x308B;&#x3068;&#x304D;&#x3001;Rust&#x306F;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x3092;&#x89E3;&#x653E;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<pre><code class="lang-Rust"><span class="hljs-function"><span class="hljs-keyword">fn</span> <span class="hljs-title">hoge</span></span>() {
    <span class="hljs-keyword">let</span> v = <span class="hljs-built_in">vec!</span>[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];
}
</code></pre>
<p><code>v</code>&#x304C;&#x30B9;&#x30B3;&#x30FC;&#x30D7;&#x306B;&#x5165;&#x308B;&#x3068;&#x304D;&#x3001;&#x65B0;&#x3057;&#x3044; Vec<t> &#x304C;&#x4F5C;&#x3089;&#x308C;&#x3001;&#x30D2;&#x30FC;&#x30D7;&#x306B;&#x7A7A;&#x9593;&#x3092;&#x5272;&#x308A;&#x5F53;&#x3066;&#x307E;&#x3059;&#x3002;<code>hoge()</code> &#x306E;&#x7D42;&#x4E86;&#x6642; <code>v</code> &#x304C;&#x30B9;&#x30B3;&#x30FC;&#x30D7;&#x304B;&#x3089;&#x5916;&#x308C;&#x308B;&#x3068;&#x304D;&#x3001;Rust&#x306F;&#x30D9;&#x30AF;&#x30BF;&#x306B;&#x95A2;&#x9023;&#x3059;&#x308B;&#x3082;&#x306E;<strong>&#x5168;&#x3066;</strong>&#x3092;&#x53D6;&#x308A;&#x9664;&#x304D;&#x307E;&#x3059;&#x3002;&#x305D;&#x308C;&#x304C;&#x30D2;&#x30FC;&#x30D7;&#x5272;&#x5F53;&#x3066;&#x306E;&#x30E1;&#x30E2;&#x30EA;&#x3067;&#x3042;&#x3063;&#x3066;&#x3082;&#x3067;&#x3059;&#x3002;</t></p>
<h2 id="&#x30E0;&#x30FC;&#x30D6;&#x30BB;&#x30DE;&#x30F3;&#x30C6;&#x30A3;&#x30AF;&#x30B9;">&#x30E0;&#x30FC;&#x30D6;&#x30BB;&#x30DE;&#x30F3;&#x30C6;&#x30A3;&#x30AF;&#x30B9;</h2>
<p>Rust&#x3067;&#x306F;&#x4E0E;&#x3048;&#x3089;&#x308C;&#x305F;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x5909;&#x6570;&#x304C; 1&#x3064;&#x3060;&#x3051; &#x3067;&#x3059;&#x3002;</p>
<pre><code class="lang-Rust"><span class="hljs-keyword">let</span> v = <span class="hljs-built_in">vec!</span>[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];
<span class="hljs-keyword">let</span> v2 = v;
<span class="hljs-built_in">println!</span>(<span class="hljs-string">&quot;{}&quot;</span>, v[<span class="hljs-number">0</span>]); <span class="hljs-comment">// &#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x30A8;&#x30E9;&#x30FC; &quot;use of moved value: `v`&quot;</span>
</code></pre>
<p>&#x6240;&#x6709;&#x6A29;&#x3092;&#x53D7;&#x3051;&#x53D6;&#x308B;&#x95A2;&#x6570;&#x3092;&#x5B9A;&#x7FA9;&#x3057;&#x3066;&#x3001;&#x5F15;&#x6570;&#x3068;&#x3057;&#x3066;&#x6E21;&#x3057;&#x305F;&#x5834;&#x5408;&#x3067;&#x3082;&#x540C;&#x3058;&#x3088;&#x3046;&#x306A;&#x3053;&#x3068;&#x304C;&#x8D77;&#x304D;&#x307E;&#x3059;&#x3002;</p>
<pre><code class="lang-Rust"><span class="hljs-function"><span class="hljs-keyword">fn</span> <span class="hljs-title">take</span></span>(v: <span class="hljs-built_in">Vec</span>&lt;<span class="hljs-keyword">i32</span>&gt;) {
    <span class="hljs-comment">// &#x3053;&#x3053;&#x3067;&#x4F55;&#x304C;&#x8D77;&#x304D;&#x308B;&#x304B;&#x306F;&#x91CD;&#x8981;&#x3067;&#x306F;&#x306A;&#x3044;</span>
}
<span class="hljs-keyword">let</span> v = <span class="hljs-built_in">vec!</span>[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];
take(v);
<span class="hljs-built_in">println!</span>(<span class="hljs-string">&quot;{}&quot;</span>, v[<span class="hljs-number">0</span>]); <span class="hljs-comment">// &#x540C;&#x3058;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x30A8;&#x30E9;&#x30FC;</span>
</code></pre>
<p>&#x6240;&#x6709;&#x6A29;&#x3092;&#x4F55;&#x304B;&#x5225;&#x306E;&#x3082;&#x306E;&#x306B;&#x8EE2;&#x9001;&#x3059;&#x308B;&#x3068;&#x304D;&#x3001;&#x53C2;&#x7167;&#x3059;&#x308B;&#x3082;&#x306E;&#x3092;&#x300C;&#x30E0;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x300D;&#x3068;&#x8A00;&#x3044;&#x307E;&#x3059;&#x3002;</p>
<p>&#x5909;&#x6570;&#x3092;&#x30E0;&#x30FC;&#x30D6;&#x3057;&#x305F;&#x5F8C;&#x3067;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;&#x7406;&#x7531;&#x3092;&#x8AAC;&#x660E;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<pre><code class="lang-Rust"><span class="hljs-keyword">let</span> v = <span class="hljs-built_in">vec!</span>[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];
<span class="hljs-keyword">let</span> v2 = v;
</code></pre>
<p>&#x6700;&#x521D;&#x306E;&#x884C;&#x306F;&#x30D9;&#x30AF;&#x30BF;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;<code>v</code>&#x3068;&#x305D;&#x308C;&#x306E;&#x542B;&#x3080;&#x30C7;&#x30FC;&#x30BF;&#x306B;&#x30E1;&#x30E2;&#x30EA;&#x3092;&#x5272;&#x308A;&#x5F53;&#x3066;&#x307E;&#x3059;&#x3002; &#x30D9;&#x30AF;&#x30BF;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306F; &#x30B9;&#x30BF;&#x30C3;&#x30AF; &#x306B;&#x4FDD;&#x5B58;&#x3055;&#x308C;&#x3001;&#x30D2;&#x30FC;&#x30D7;&#x306B;&#x4FDD;&#x5B58;&#x3055;&#x308C;&#x305F;&#x5185;&#x5BB9;<code>[1, 2, 3]</code>&#x3078;&#x306E;&#x30DD;&#x30A4;&#x30F3;&#x30BF;&#x3092;&#x6301;&#x3061;&#x307E;&#x3059;&#x3002;<br><code>v</code>&#x3092;<code>v2</code>&#x306B;&#x30E0;&#x30FC;&#x30D6;&#x3059;&#x308B;&#x3068;&#x3001;<code>v2</code>&#x306B;&#x30D9;&#x30AF;&#x30BF;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x306E;&#x30B3;&#x30D4;&#x30FC;&#x3092;&#x5272;&#x308A;&#x5F53;&#x3066;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x30B7;&#x30E3;&#x30ED;&#x30FC;&#x30B3;&#x30D4;&#x30FC;&#x306F;&#x3001;&#x5B9F;&#x969B;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x542B;&#x3080;&#x30D2;&#x30FC;&#x30D7;&#x5272;&#x308A;&#x5F53;&#x3066;&#x306E;&#x30B3;&#x30D4;&#x30FC;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x307E;&#x305B;&#x3093; &#x3002;&#x305D;&#x308C;&#x306F;&#x3001;&#x30D2;&#x30FC;&#x30D7;&#x4E0A;&#x306E;&#x30D9;&#x30AF;&#x30BF;&#x306E;&#x5185;&#x5BB9;&#x3078;&#x306E;&#x30DD;&#x30A4;&#x30F3;&#x30BF;&#x304C;2&#x3064;&#x3042;&#x308B;&#x3053;&#x3068;&#x3092;&#x610F;&#x5473;&#x3057;&#x3001;&#x30C7;&#x30FC;&#x30BF;&#x7AF6;&#x5408;&#x3092;&#x5F15;&#x304D;&#x8D77;&#x3053;&#x3057;&#x304B;&#x306D;&#x306A;&#x3044;&#x305F;&#x3081;Rust&#x306E;&#x5B89;&#x5168;&#x6027;&#x4FDD;&#x8A3C;&#x306B;&#x9055;&#x53CD;&#x3057;&#x307E;&#x3059;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;Rust&#x306F;&#x30E0;&#x30FC;&#x30D6;&#x3092;&#x7D42;&#x3048;&#x305F;&#x5F8C;&#x306E;<code>v</code>&#x306E;&#x4F7F;&#x7528;&#x3092;&#x7981;&#x6B62;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<p>&#x305F;&#x3068;&#x3048;&#x3070;&#x3001;&#x30D9;&#x30AF;&#x30C8;&#x30EB;&#x3092;v2&#x304B;&#x3089;2&#x3064;&#x306E;&#x8981;&#x7D20;&#x306B;&#x5207;&#x308A;&#x6368;&#x3066;&#x305F;&#x5834;&#x5408;&#x3001;</p>
<pre><code class="lang-Rust">v2.truncate&#xFF08;<span class="hljs-number">2</span>&#xFF09;; <span class="hljs-comment">// &#x5F15;&#x6570;&#x4EE5;&#x964D;&#x306E;&#x30A4;&#x30F3;&#x30C7;&#x30C3;&#x30AF;&#x30B9;&#x306E;&#x8981;&#x7D20;&#x3092;&#x524A;&#x9664;&#x3059;&#x308B;</span>
</code></pre>
<p>&#x3082;&#x3057;<code>v</code>&#x304C;&#x307E;&#x3060;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x53EF;&#x80FD;&#x3060;&#x3063;&#x305F;&#x5834;&#x5408;&#x30D2;&#x30FC;&#x30D7;&#x30C7;&#x30FC;&#x30BF;&#x304C;&#x5207;&#x308A;&#x6368;&#x3066;&#x3089;&#x308C;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x304C;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x305F;&#x3081;&#x3001;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x4E0A;&#x306E;&#x30D9;&#x30AF;&#x30C8;&#x30EB;v&#x306E;&#x90E8;&#x5206;&#x306F;&#x3001;&#x30D2;&#x30FC;&#x30D7;&#x4E0A;&#x306E;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x90E8;&#x5206;&#x3068;&#x4E00;&#x81F4;&#x3057;&#x307E;&#x305B;&#x3093;&#x3002; v&#x306F;&#x307E;&#x3060;&#x30D9;&#x30AF;&#x30C8;&#x30EB;&#x306B;3&#x3064;&#x306E;&#x8981;&#x7D20;&#x304C;&#x3042;&#x308B;&#x3068;&#x601D;&#x3063;&#x3066;&#x3044;&#x3066;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x306F;&#x5B58;&#x5728;&#x3057;&#x306A;&#x3044;&#x8981;&#x7D20;<code>v[2]</code>&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3001;&#x3053;&#x308C;&#x306F;&#x30BB;&#x30B0;&#x30E1;&#x30F3;&#x30C6;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306B;&#x3064;&#x306A;&#x304C;&#x308B;&#x304B;&#x3001;&#x6A29;&#x9650;&#x306E;&#x306A;&#x3044;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x304C;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3067;&#x304D;&#x306A;&#x3044;&#x30E1;&#x30E2;&#x30EA;&#x304B;&#x3089;&#x8AAD;&#x307F;&#x53D6;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3068;&#x3044;&#x3063;&#x305F;&#x4E0D;&#x5177;&#x5408;&#x306B;&#x3064;&#x306A;&#x304C;&#x308A;&#x307E;&#x3059;&#x3002;
&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;Rust&#x306F;&#x30E0;&#x30FC;&#x30D6;&#x3092;&#x7D42;&#x3048;&#x305F;&#x5F8C;&#x306E;<code>v</code>&#x306E;&#x4F7F;&#x7528;&#x3092;&#x7981;&#x6B62;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<h2 id="copy&#x578B;">Copy&#x578B;</h2>
<p>&#x6240;&#x6709;&#x6A29;&#x304C;&#x5225;&#x306E;&#x5909;&#x6570;&#x306B;&#x8EE2;&#x9001;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001;&#x5143;&#x306E;&#x5909;&#x6570;&#x306F;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x307E;&#x305B;&#x3093;&#x3002;&#x3057;&#x304B;&#x3057;&#x3001;&#x3053;&#x306E;&#x632F;&#x308B;&#x821E;&#x3044;&#x3092;&#x5909;&#x3048;&#x308B;<code>&#x30C8;&#x30EC;&#x30A4;&#x30C8;</code>&#x3068;&#x3044;&#x3046;&#x3082;&#x306E;&#x304C;&#x3042;&#x308A;&#x3001;&#x30B3;&#x30D4;&#x30FC;&#x3068;&#x547C;&#x3070;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x8A73;&#x3057;&#x304F;&#x306F;&#x5F8C;&#x307B;&#x3069;&#x8AAC;&#x660E;&#x3057;&#x307E;&#x3059;&#x304C;&#x4ECA;&#x306E;&#x3068;&#x3053;&#x308D;&#x306F;&#x7279;&#x5225;&#x306A;&#x52D5;&#x4F5C;&#x3092;&#x8FFD;&#x52A0;&#x3059;&#x308B;&#x7279;&#x5B9A;&#x306E;&#x30BF;&#x30A4;&#x30D7;&#x306E;&#x6CE8;&#x91C8;&#x3068;&#x8003;&#x3048;&#x3066;&#x304A;&#x304D;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;</p>
<pre><code class="lang-Rust"><span class="hljs-keyword">let</span> v = <span class="hljs-number">1</span>;
<span class="hljs-keyword">let</span> v2 = v;
<span class="hljs-built_in">println!</span>(<span class="hljs-string">&quot;{}&quot;</span>, v);
</code></pre>
<p>&#x3053;&#x306E;&#x5834;&#x5408;&#x3001;<code>v</code>&#x306F;<code>i32</code>&#x3067;&#x3001;<code>i32</code>&#x306F;&#x30B3;&#x30D4;&#x30FC;&#x30C8;&#x30EC;&#x30A4;&#x30C8;&#x3092;&#x30A4;&#x30F3;&#x30D7;&#x30EA;&#x30E1;&#x30F3;&#x30C8;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;v&#x3092;v2&#x306B;&#x4EE3;&#x5165;&#x3059;&#x308B;&#x3068;&#x3001;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x30B3;&#x30D4;&#x30FC;&#x304C;&#x4F5C;&#x6210;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;&#x3001;&#x79FB;&#x52D5;&#x3068;&#x306F;&#x7570;&#x306A;&#x308A;&#x3001;v&#x306F;&#x305D;&#x306E;&#x5F8C;&#x3082;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306F;&#x3001;i32&#x306B;&#x306F;&#x4ED6;&#x306E;&#x5834;&#x6240;&#x3078;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x3078;&#x306E;&#x30DD;&#x30A4;&#x30F3;&#x30BF;&#x3067;&#x306F;&#x306A;&#x3044;&#x305F;&#x3081;&#x3001;&#x30B3;&#x30D4;&#x30FC;&#x306F;&#x5B8C;&#x5168;&#x306A;&#x30B3;&#x30D4;&#x30FC;&#x3060;&#x304B;&#x3089;&#x3067;&#x3059;&#x3002;<br>&#x3059;&#x3079;&#x3066;&#x306E;&#x30D7;&#x30EA;&#x30DF;&#x30C6;&#x30A3;&#x30D6;&#x578B;&#x306F;&#x30B3;&#x30D4;&#x30FC;&#x7279;&#x6027;&#x3092;&#x5B9F;&#x88C5;&#x3057;&#x3066;&#x3044;&#x308B;&#x305F;&#x3081;&#x3001;&#x6240;&#x6709;&#x6A29;&#x30EB;&#x30FC;&#x30EB;&#x306B;&#x3057;&#x305F;&#x304C;&#x3063;&#x3066;&#x6240;&#x6709;&#x6A29;&#x304C;&#x5F15;&#x304D;&#x7D99;&#x304C;&#x308C;&#x308B;&#x308F;&#x3051;&#x3067;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;</p>
<pre><code class="lang-Rust"><span class="hljs-function"><span class="hljs-keyword">fn</span> <span class="hljs-title">main</span></span>() {
    <span class="hljs-keyword">let</span> x = <span class="hljs-number">3</span>;
    <span class="hljs-keyword">let</span> y = x;
    <span class="hljs-built_in">println!</span>(<span class="hljs-string">&quot;{}&quot;</span>, x); <span class="hljs-comment">// 3</span>
}
</code></pre>
<p>&#x72EC;&#x81EA;&#x306E; Copy &#x578B;&#x3092;&#x4F5C;&#x308B;&#x65B9;&#x6CD5;&#x306F; &#x30C8;&#x30EC;&#x30A4;&#x30C8; &#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x8AAC;&#x660E;&#x3057;&#x307E;&#x3059;&#x3002;</p>
<h2 id="&#x6240;&#x6709;&#x6A29;&#x79FB;&#x52D5;">&#x6240;&#x6709;&#x6A29;&#x79FB;&#x52D5;</h2>
<p>&#x3082;&#x3057;&#x95A2;&#x6570;&#x3067;&#x6240;&#x6709;&#x6A29;&#x3092;&#x8FD4;&#x3055;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x306E;&#x3067;&#x3042;&#x308C;&#x3070;&#x3001;&#x3053;&#x3046;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<pre><code class="lang-Rust"><span class="hljs-function"><span class="hljs-keyword">fn</span> <span class="hljs-title">foo</span></span>(v: <span class="hljs-built_in">Vec</span>&lt;<span class="hljs-keyword">i32</span>&gt;) -&gt; <span class="hljs-built_in">Vec</span>&lt;<span class="hljs-keyword">i32</span>&gt; {
    <span class="hljs-comment">// v&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x4F5C;&#x696D;&#x3092;&#x884C;&#x3046;</span>
    v <span class="hljs-comment">// &#x6240;&#x6709;&#x6A29;&#x3092;&#x8FD4;&#x3059;</span>
}
</code></pre>
<p>&#x3053;&#x308C;&#x306F;&#x975E;&#x5E38;&#x306B;&#x9762;&#x5012;&#x3067;&#x3059;&#x3002;<br>&#x3082;&#x3063;&#x3068;&#x305F;&#x304F;&#x3055;&#x3093;&#x306E;&#x6240;&#x6709;&#x6A29;&#x3092;&#x53D7;&#x3051;&#x53D6;&#x308C;&#x3070;&#x3001;&#x305D;&#x308C;&#x306F;&#x3082;&#x3063;&#x3068;&#x3072;&#x3069;&#x304F;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p>
<pre><code class="lang-Rust"><span class="hljs-function"><span class="hljs-keyword">fn</span> <span class="hljs-title">foo</span></span>(v1: <span class="hljs-built_in">Vec</span>&lt;<span class="hljs-keyword">i32</span>&gt;, v2: <span class="hljs-built_in">Vec</span>&lt;<span class="hljs-keyword">i32</span>&gt;) -&gt; (<span class="hljs-built_in">Vec</span>&lt;<span class="hljs-keyword">i32</span>&gt;, <span class="hljs-built_in">Vec</span>&lt;<span class="hljs-keyword">i32</span>&gt;, <span class="hljs-keyword">i32</span>) {
    <span class="hljs-comment">// v1&#x3068;v2&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x4F5C;&#x696D;&#x3092;&#x884C;&#x3046;</span>
    (v1, v2, <span class="hljs-number">42</span>) <span class="hljs-comment">// &#x6240;&#x6709;&#x6A29;&#x3068;&#x95A2;&#x6570;&#x306E;&#x7D50;&#x679C;&#x3092;&#x8FD4;&#x3059;</span>
}

<span class="hljs-keyword">let</span> v1 = <span class="hljs-built_in">vec!</span>[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];
<span class="hljs-keyword">let</span> v2 = <span class="hljs-built_in">vec!</span>[<span class="hljs-number">1</span>, <span class="hljs-number">2</span>, <span class="hljs-number">3</span>];

<span class="hljs-keyword">let</span> (v1, v2, answer) = foo(v1, v2);
</code></pre>
<p>&#x3068;&#x3066;&#x3082;&#x9762;&#x5012;&#x3067;&#x3059;&#x3002;<br>&#x3053;&#x308C;&#x3092;&#x89E3;&#x6C7A;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x6B21;&#x306B;&#x501F;&#x7528;&#x3068;&#x3044;&#x3046;&#x6A5F;&#x80FD;&#x3092;&#x8AAC;&#x660E;&#x3057;&#x307E;&#x3059;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="loop.html" class="navigation navigation-prev " aria-label="Previous page: ループ">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="vector.html" class="navigation navigation-next " aria-label="Next page: ベクター">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"所有権","level":"1.10","depth":1,"next":{"title":"ベクター","level":"1.11","depth":1,"path":"vector.md","ref":"vector.md","articles":[]},"previous":{"title":"ループ","level":"1.9","depth":1,"path":"loop.md","ref":"loop.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ownership.md","mtime":"2017-02-22T07:44:48.710Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-02-22T07:45:31.499Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

